{"version":"1","records":[{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙"},"type":"lvl1","url":"/paper","position":0},{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙"},"content":"A tutorial to evolve markdown documents and notebooks into structured data\n\nAuthors: Rowan Cockett1,2 Affiliations: 1Executable Books, 2 Curvenote License: CC-BY\n\nAbstract\n\nWe introduce, a set of open-source, community-driven tools for MyST Markdown (\n\nmyst.tools) designed for scientific communication, including a powerful authoring framework that supports blogs, online books, scientific papers, reports and journals articles.","type":"content","url":"/paper","position":1},{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙","lvl2":"Background"},"type":"lvl2","url":"/paper#background","position":2},{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙","lvl2":"Background"},"content":"Scientific communication today is designed around print documents and pay-walled access to content. Over the last decade, the open-science movement has accelerated the use of pre-print services and data archives that are vastly improving the accessibility of scientific content. However, these systems are not designed for communicating modern scientific outputs, which encompasses so much more than a paper-centric model of the scholarly literature.\n\nWe believe how we share and communicate scientific knowledge should evolve past the status quo of print-based publishing and all the limitations of paper.\n\nThe communication and collaboration tools that we are building in the Project Jupyter are built to follow the FORCE11 recommendations (Bourne et al., 2012). Specifically:\n\nrethink the unit and form of scholarly publication;\n\ndevelop tools and technologies to better support the scholarly lifecycle; and\n\nadd data, software, and workflows as first-class research objects.\n\nBy bringing professional, high-quality tools for science communication into the research lifecycle, we believe we can improve the collection and preservation of scholarly metadata (citations, cross-references, annotations, etc.) as well as open up new ways to communicate science with interactive figures & equations, computation, and reactivity.\n\nThe tools that are being built by the Project Jupyter are focused on introducing a new Markup language, MyST (Markedly Structured Text), that works seamlessly with the Jupyter community to enhance and promote a new path to document creation and publishing for next-generation scientific textbooks, blogs, and lectures. Our team is currently supported by the \n\nSloan Foundation, (\n\nGrant #9231).\n\nMyST enables rich content generation and is a powerful format for scientific and technical communication. JupyterBook uses MyST and has broad adoption in publishing tutorials and educational content focused around Jupyter Notebooks.\n\nThe components behind Jupyter Book are downloaded 30,000 times a day, with 750K downloads last month.\n\nThe current toolchain used by \n\nJupyterBook is based on \n\nSphinx, which is an open-source documentation system used in many software projects, especially in the Python ecosystem. mystjs is a similar tool to \n\nSphinx, however, designed specifically for scientific communication. In addition to building websites, mystjs can also help you create scientific PDFs, Microsoft Word documents, and JATS XML (used in scientific publishing).\n\nmystjs uses existing, modern web-frameworks in place of the \n\nSphinx build system. These tools come out-of-the-box with prefetching for faster navigation, smaller network payloads through modern web-bundlers, image optimization, partial-page refresh through single-page application. Many of these features, performance and accessibility improvements are difficult, if not impossible, to create inside of the \n\nSphinx build system.\n\nIn 2022, the Executable Books team started work to document the specification behind the markup language, called \n\nmyst-spec, this work has enabled other tools and implementations in the scientific ecosystem to build on MyST (e.g. \n\nscientific authoring tools, and \n\ndocumentation systems).\n\nThe mystjs ecosystem was developed as a collaboration between \n\nCurvenote, \n\n2i2c and the \n\nExecutableBooks team. The initial version of mystjs was originally release by \n\nCurvenote as the \n\nCurvenote CLI under the MIT license, and transferred to the \n\nExecutableBooks team in October 2022. The goal of the project is to enable the same rich content and authoring experiences that \n\nSphinx allows for software documentation, with a focus on web-first technologies (Javascript), interactivity, accessibility, scientific references (e.g. DOIs and other persistent IDs), professional PDF outputs, and JATS XML documents for scientific archiving.","type":"content","url":"/paper#background","position":3},{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙","lvl2":"MyST Project"},"type":"lvl2","url":"/paper#myst-project","position":4},{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙","lvl2":"MyST Project"},"content":"In this paper we introduce mystjs, which allows the popular MyST Markdown syntax to be run directly in a web browser, opening up new workflows for components to be used in web-based editors, \n\ndirectly in Jupyter and in JupyterLite. The libraries work with current MyST Markdown documents/projects and can export to \n\nLaTeX/PDF, \n\nMicrosoft Word and \n\nJATS as well as multiple website templates using a \n\nmodern React-based renderer. There are currently over 400 scientific journals that are supported through \n\ntemplates, with \n\nnew LaTeX templates that can be added easily using a Jinja-based templating package, called \n\njtex.\n\nIn our paper we will give an overview of the MyST ecosystem, how to use MyST tools in conjunction with existing Jupyter Notebooks, markdown documents, and JupyterBooks to create professional PDFs and interactive websites, books, blogs and scientific articles. We give special attention to the additions around structured data, standards in publishing (e.g. efforts in representing Notebooks as JATS XML), rich \n\nfrontmatter and bringing \n\ncross-references and \n\npersistent IDs to life with interactive hover-tooltips (\n\nORCID, RoR, \n\nRRIDs, \n\nDOIs, \n\nintersphinx, \n\nwikipedia, \n\nJATS, \n\nGitHub code, and more!). This rich metadata and structured content can be used directly to improve science communication both through self-publishing books, blogs, and lab websites — as well as journals that incorporate Jupyter Notebooks.","type":"content","url":"/paper#myst-project","position":5},{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙","lvl2":"Features of MyST"},"type":"lvl2","url":"/paper#features-of-myst","position":6},{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙","lvl2":"Features of MyST"},"content":"MyST is focused on scientific writing, and ensuring that citations are first class both for writing and for reading (see Figure 1).\n\n\nFigure 1: Citations are rendered with a popup directly inline.\n\nMyST aims to show as much information in context as possible, for example, Figure 2 shows a reading experience for a referenced equation: you can immediately click on the reference, see the equation, all without loosing any context -- ultimately saving you time. Head et al. (2021) found that these ideas both improved the overall reading experience of articles as well as allowed researchers to answer questions about an article 26% faster when compared to a traditional PDF!\n\n\nFigure 2: In context cross-references improve the reading experience.\n\nOne of the important underlying goals of practicing reproducibility, sharing more of the methods and data behind a scientific work so that other researchers can both verify as well as build upon your findings. One of the exciting ways to pull for reproducibility is to make documents directly linked to data and computation! In Figure 3, we are showing outputs from a Jupyter Notebook directly part of the published scientific narrative.\n\n\nFigure 3: Embedding data, interactivity and computation into a MyST article.\n\nTo drive all of these features, the contents of a MyST document needs to be well defined. This is critical for powering interactive hovers, linked citations, and compatibility with scientific publishing standards like the Journal Article Metadata Tag Suite (JATS). We have an emerging specification for MyST, \n\nmyst-spec, that aims to capture this information and transform it between many different formats, like PDF, Word, JSON, and JATS XML (Figure 4). This specification is arrived at through a community-centric MyST Enhancement Proposal (\n\nMEP) process.\n\n\nFigure 4: The data behind MyST is structured, which means we can transform it into many different document types and use it to power all sorts of exciting features!\n\nOne of the common forms of scientific communication today is through PDF documents. MyST has excellent support for creating PDF documents, using a data-driven templating library called jtex. The document in Figure 5 was created using MyST!\n\n\nFigure 5: A PDF rendering through MyST.","type":"content","url":"/paper#features-of-myst","position":7},{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙","lvl2":"Conclusion"},"type":"lvl2","url":"/paper#conclusion","position":8},{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙","lvl2":"Conclusion"},"content":"There are many opportunities to improve open-science communication, to make it more interactive, accessible, more reproducible, and both produce and use structured data throughout the research-writing process. The mystjs ecosystem of tools is designed with structured data at its core. We would love if you gave it a try -- learn to get started at \n\nhttps://myst.tools.","type":"content","url":"/paper#conclusion","position":9},{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙","lvl2":"References"},"type":"lvl2","url":"/paper#references","position":10},{"hierarchy":{"lvl1":"How to MyST, without being mystified 🧙","lvl2":"References"},"content":"Bourne, Philip E., Clark, Timothy W., Dale, Robert, De Waard, Anita, Herman, Ivan, Hovy, Eduard H., Shotton, David. (2012)“Improving The Future of Research Communications and e-Scholarship”. FORCE11. doi:10.4230/DAGMAN.1.1.41\n\nHead, A., Lo, K., Kang, D., Fok, R., Skjonsberg, S., Weld, D. S., & Hearst, M. A. (2021, May). Augmenting Scientific Papers with Just-in-Time, Position-Sensitive Definitions of Terms and Symbols. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 10.1145/3411764.3445648","type":"content","url":"/paper#references","position":11},{"hierarchy":{"lvl1":"Linking Interactive Notebooks"},"type":"lvl1","url":"/notebook","position":0},{"hierarchy":{"lvl1":"Linking Interactive Notebooks"},"content":"MyST allows you to directly include Jupyter Notebooks in your books, documents and websites.\nThis Jupyter Notebook can be rendered directly using MyST.\n\nFor example, let us import altair and create a demo of an interactive plot!\n\nimport altair as alt\nfrom vega_datasets import data\n\nsource = data.cars()\nbrush = alt.selection_interval(encodings=['x'])\npoints = alt.Chart(source).mark_point().encode(\n    x='Horsepower:Q',\n    y='Miles_per_Gallon:Q',\n    size='Acceleration',\n    color=alt.condition(brush, 'Origin:N', alt.value('lightgray'))\n).add_selection(brush)\n\nbars = alt.Chart(source).mark_bar().encode(\n    y='Origin:N',\n    color='Origin:N',\n    x='count(Origin):Q'\n).transform_filter(brush)\n\nWe can now plot the altair example, which is fully interactive, try dragging in the plot to select cars by their horsepower.\n\npoints & bars\n\n# https://matplotlib.org/stable/gallery/statistics/time_series_histogram.html#sphx-glr-gallery-statistics-time-series-histogram-py\nfrom copy import copy\n\nimport numpy as np\nimport numpy.matlib\nimport matplotlib.pyplot as plt\nfrom matplotlib.colors import LogNorm\n\n# Make some data; a 1D random walk + small fraction of sine waves\nnum_series = 1000\nnum_points = 100\nSNR = 0.10  # Signal to Noise Ratio\nx = np.linspace(0, 4 * np.pi, num_points)\n# Generate unbiased Gaussian random walks\nY = np.cumsum(np.random.randn(num_series, num_points), axis=-1)\n# Generate sinusoidal signals\nnum_signal = int(round(SNR * num_series))\nphi = (np.pi / 8) * np.random.randn(num_signal, 1)  # small random offset\nY[-num_signal:] = (\n    np.sqrt(np.arange(num_points))[None, :]  # random walk RMS scaling factor\n    * (np.sin(x[None, :] - phi)\n       + 0.05 * np.random.randn(num_signal, num_points))  # small random noise\n)\n\n\n# Now we will convert the multiple time series into a histogram. Not only will\n# the hidden signal be more visible, but it is also a much quicker procedure.\n# Linearly interpolate between the points in each time series\nnum_fine = 800\nx_fine = np.linspace(x.min(), x.max(), num_fine)\ny_fine = np.empty((num_series, num_fine), dtype=float)\nfor i in range(num_series):\n    y_fine[i, :] = np.interp(x_fine, x, Y[i, :])\ny_fine = y_fine.flatten()\nx_fine = np.matlib.repmat(x_fine, num_series, 1).flatten()\n\nImportant!\nThis data is simulated, and may just be random noise! 🔊\n\nfig, axes = plt.subplots(figsize=(8, 4), constrained_layout=True)\ncmap = copy(plt.cm.plasma)\ncmap.set_bad(cmap(0))\nh, xedges, yedges = np.histogram2d(x_fine, y_fine, bins=[400, 100])\npcm = axes.pcolormesh(xedges, yedges, h.T, cmap=cmap,\n                         norm=LogNorm(vmax=1.5e2), rasterized=True)\nfig.colorbar(pcm, ax=axes, label=\"# points\", pad=0)\naxes.set_title(\"2d histogram and log color scale\");","type":"content","url":"/notebook","position":1},{"hierarchy":{"lvl1":"Report"},"type":"lvl1","url":"/paper-1","position":0},{"hierarchy":{"lvl1":"Report"},"content":"Abstract\n\n","type":"content","url":"/paper-1","position":1},{"hierarchy":{"lvl1":"Report","lvl2":"Introduction"},"type":"lvl2","url":"/paper-1#introduction","position":2},{"hierarchy":{"lvl1":"Report","lvl2":"Introduction"},"content":"\n\n","type":"content","url":"/paper-1#introduction","position":3},{"hierarchy":{"lvl1":"Report","lvl2":"Experimentals"},"type":"lvl2","url":"/paper-1#experimentals","position":4},{"hierarchy":{"lvl1":"Report","lvl2":"Experimentals"},"content":"\n\n","type":"content","url":"/paper-1#experimentals","position":5},{"hierarchy":{"lvl1":"Report","lvl2":"Results"},"type":"lvl2","url":"/paper-1#results","position":6},{"hierarchy":{"lvl1":"Report","lvl2":"Results"},"content":"\n\n","type":"content","url":"/paper-1#results","position":7},{"hierarchy":{"lvl1":"Report","lvl2":"Conclusion"},"type":"lvl2","url":"/paper-1#conclusion","position":8},{"hierarchy":{"lvl1":"Report","lvl2":"Conclusion"},"content":"","type":"content","url":"/paper-1#conclusion","position":9}]}